<?xml version="1.0"?>
<?xml-stylesheet type="text/css" href="c:\inetpub\webpubdotnet\directio\web\css\bases\fipbinvkhs.css" ?>
<top>
    <TIT4/>
    <INVID ID="FRB.FOBJ4.BULL.9004">FRB.FOBJ4.BULL.9004</INVID>
    <P>
        <AI R="FOBJBULL/FOBJBULL9004R.jpg$$">
            <IMG SRC="$RELDIR$FOBJBULL/FOBJBULL9004R_v.jpg"/>
        </AI>
    </P>
    <ISBD>
        <Z1>
            <TITI>
                <NXP>BULL Poin&#x00e7;onneuse</NXP>
                <T></T>
                <NXP>Pelerod</NXP>
            </TITI>
        </Z1>
        <Z0>
            <TYPE>Objet :</TYPE>
            <INV>2014</INV>
            <LIEU/>
        </Z0>
        <Z2>
            <SXP>S/N/ 10801980</SXP>
        </Z2>
        <Z3/>
        <Z4>
            <EXP>s.l.</EXP>
            <T>:</T>
            <NXP>BULL</NXP>
            <T>,</T>
            <T/>
            <DT D="00001948">1948</DT>
        </Z4>
        <Z5>
            <T>L 120 x l 67 x H 100 cm; 125 kg; gris</T>
        </Z5>
        <Z6/>
        <Z7>
            <T>Fonctionne</T>
        </Z7>
        <Z8>
            <NXP>Collection BULL-FEBB</NXP>
            <T>; Don de</T>
            <NXP>FEB-Belfort</NXP>
            <T></T>
        </Z8>
    </ISBD>
    <STIT4>
        <NXP>BULLPoin&#x00e7;onneuse</NXP>
        <T></T>
        <NXP>Pelerod</NXP>
        <T></T>
        <NXP/>
        <T/>
    </STIT4>
    <C>
        <NXP>B14</NXP>
        <T>- Cartel de l'expo "Aux racines du num&#x00e9;rique, des machines qui comptent".</T>
    </C>
    <P>
        <T>Poin&#x00e7;onneuse &#x00e0; clavier de dactylographie, &#x00e9;lectrique fonctionnant avec un courant
            alternatif de 110 ou de 220 volts.
        </T>
    </P>
    <P>
        <T>Elle est munie de 2 claviers de frappe qui sont fixes&#x00a0;:</T>
        <B/>
        <T>&#x2022; 1 clavier num&#x00e9;rique normal &#x00e0; 15 touches.</T>
        <B/>
        <T>&#x2022; 1 clavier alphanum&#x00e9;rique universel.</T>
    </P>
    <P>
        <T>Les cartes vierges sont dispos&#x00e9;es &#x00e0; l&#x2019;avance dans le magasin d&#x2019;alimentation situ&#x00e9;
            en t&#x00ea;te de la piste de perforation (contenance&#x00a0;: 400 cartes). Chaque carte vient
            automatiquement se placer en position initiale de perforation : chacune de ses colonnes se positionne
            ensuite pour recevoir la perforation qui lui correspond. En fin de piste, les cartes sont &#x00e9;ject&#x00e9;es
            automatiquement dans la case de r&#x00e9;ception.
        </T>
    </P>
    <P>
        <T>La machine est munie d&#x2019;un tabulateur dont les positions d&#x2019;arr&#x00ea;t sont d&#x00e9;termin&#x00e9;es
            par des cavaliers dispos&#x00e9;s &#x00e0; volont&#x00e9; le long d&#x2019;une r&#x00e8;gle crant&#x00e9;e.
            La reproduction automatique de constantes peut &#x00ea;tre assur&#x00e9;e au moyen d&#x2019;une carte ma&#x00ee;tresse
            qui se d&#x00e9;place parall&#x00e8;lement &#x00e0; la carte en cours de perforation et en synchronisation
            avec elle, sur une piste sp&#x00e9;ciale situ&#x00e9;e en arri&#x00e8;re de la piste normale. Les constantes
            port&#x00e9;es par la carte ma&#x00ee;tresse, sont, pour tout ou partie, reproduites sur les autres cartes d&#x00e9;filant
            &#x00e0; la vitesse de 12 colonnes/seconde.
        </T>
    </P>
    <P>
        <T>La machine peut &#x00ea;tre munie du dispositif de retournement des cartes au moment de leur &#x00e9;jection
            dans la case de r&#x00e9;ception. Ce dispositif permet de remettre les cartes dans l&#x2019;ordre o&#x00f9;
            elles se trouvaient dans le magasin d&#x2019;alimentation.
        </T>
    </P>
    <P>
        <DP D="00112019">Date de publication: novembre 2019</DP>
    </P>
</top>
