<?xml version="1.0"?>
<?xml-stylesheet type="text/css" href="c:\inetpub\webpubdotnet\directio\web\css\bases\fipbinvkhs.css" ?>
<top>
    <TIT4/>
    <INVID ID="FRB.FOBJ4.BULL.9006">FRB.FOBJ4.BULL.9006</INVID>
    <P>
        <AI R="FOBJBULL/FOBJBULL9006R.jpg$$">
            <IMG SRC="$RELDIR$FOBJBULL/FOBJBULL9006R_v.jpg"/>
        </AI>
    </P>
    <ISBD>
        <Z1>
            <TITI>
                <T/>
                <NXP>BULL Trieuse</NXP>
                <T></T>
                <NXP>D3</NXP>
            </TITI>
        </Z1>
        <Z0>
            <TYPE>Objet :</TYPE>
            <INV>2014</INV>
            <LIEU/>
        </Z0>
        <Z2>
            <SXP>S/N 30600479</SXP>
        </Z2>
        <Z3/>
        <Z4>
            <EXP>s.l.</EXP>
            <T>:</T>
            <NXP>BULL</NXP>
            <T>,</T>
            <T/>
            <DT D="00001958">1958</DT>
        </Z4>
        <Z5>
            <T>L 290 x l 50 x 114 cm; 290 kg; gris</T>
        </Z5>
        <Z6/>
        <Z7>
            <T>Fonctionne</T>
        </Z7>
        <Z8>
            <NXP>Collection BULL-FEBB</NXP>
        </Z8>
    </ISBD>
    <STIT4>
        <NXP>BULL Trieuse</NXP>
        <T></T>
        <NXP>D3</NXP>
    </STIT4>
    <C>
        <NXP>B22</NXP>
        <T>- Cartel de l'expo "Aux racines du num&#x00e9;rique, des machines qui comptent".</T>
    </C>
    <P>
        <T>Les trieuses</T>
        <NXP>D3</NXP>
        <T>traitent rapidement, non seulement les probl&#x00e8;mes de tri classique, mais encore les probl&#x00e8;mes de
            s&#x00e9;lection, de s&#x00e9;paration et d&#x2019;&#x00e9;limination de cartes. Elles permettent ainsi,
            pour les probl&#x00e8;mes faisant intervenir un seul fichier, d&#x2019;all&#x00e9;ger le travail de l&#x2019;interclasseuse
            et de traiter plus rapidement certains probl&#x00e8;mes. La trieuse
        </T>
        <NXP>D3</NXP>
        <T>peut traiter <NB>1.000</NB> cartes/minute (soit 17 cartes/seconde!). Elle atteint cette vitesse gr&#x00e2;ce
            &#x00e0; l&#x2019;&#x00e9;lectronique qui actionne les dispositifs de comparaison et de s&#x00e9;lection des
            cases au moyen de thyratrons (des tubes de puissance &#x00e0; atmosph&#x00e8;re gazeuse).
        </T>
    </P>
    <P>
        <T>La</T>
        <NXP>D3</NXP>
        <T>laisse &#x00e0; l&#x2019;utilisateur la possibilit&#x00e9; de r&#x00e9;gler lui-m&#x00ea;me les relations
            entre la lecture des perforations et l&#x2019;ouverture des cases. Cette conception nouvelle permet de
            commander l&#x2019;ouverture de n&#x2019;importe quelle case &#x00e0; partir de la lecture de n&#x2019;importe
            quelle perforation et ainsi effectuer les tris de regroupement. Il est possible de rassembler directement
            des cartes par trimestre en les triant sur le mois, sans manipulation sp&#x00e9;ciale de l&#x2019;op&#x00e9;rateur.
        </T>
    </P>
    <P>
        <T>Gr&#x00e2;ce &#x00e0; la double lecture et aux comparateurs, les trieuses</T>
        <NXP>D3</NXP>
        <T>sont capables de v&#x00e9;rifier, en m&#x00ea;me temps qu&#x2019;elles trient sur une colonne, le tri qu&#x2019;elles
            viennent d&#x2019;effectuer sur la colonne pr&#x00e9;c&#x00e9;dente.
        </T>
    </P>
    <P>
        <DP D="00112019">Date de publication: novembre 2019</DP>
    </P>
</top>
