<?xml version="1.0"?>
<?xml-stylesheet type="text/css" href="c:\inetpub\webpubdotnet\directio\web\css\bases\fipbinvkhs.css" ?>
<top>
    <TIT4/>
    <INVID ID="FRB.FOBJ4.BULL.9182">FRB.FOBJ4.BULL.9182</INVID>
    <P>
        <AI R="FOBJBULL/FOBJBULL9182R.jpg$$">
            <IMG SRC="$RELDIR$FOBJBULL/FOBJBULL9182R_v.jpg"/>
        </AI>
    </P>
    <ISBD>
        <Z1>
            <TITI>
                <NXP>BULL Poin&#x00e7;onneuse &#x00e0; main</NXP>
                <T>:</T>
                <NXP>P80</NXP>
                <T/>
            </TITI>
        </Z1>
        <Z0>
            <TYPE>Objet :</TYPE>
            <INV>2014</INV>
            <LIEU/>
        </Z0>
        <Z2>
            <SXP>S/N 2925</SXP>
        </Z2>
        <Z3/>
        <Z4>
            <EXP>s.l.</EXP>
            <T>:</T>
            <NXP>BULL</NXP>
            <T>,</T>
            <T/>
            <DT D="00001935">1935</DT>
        </Z4>
        <Z5>
            <T>L 50 x l 16 x H 15 cm; <NB>8,5</NB> kg; noir
            </T>
        </Z5>
        <Z6/>
        <Z7>
            <T>Fonctionne</T>
        </Z7>
        <Z8>
            <NXP>Collection BULL-FEBB</NXP>
        </Z8>
    </ISBD>
    <STIT4>
        <NXP>BULL Poin&#x00e7;onneuse &#x00e0; main</NXP>
        <T>:</T>
        <NXP>P80</NXP>
    </STIT4>
    <C>
        <NXP>B12</NXP>
        <T>- Cartel de l'expo "Aux racines du num&#x00e9;rique, des machines qui comptent".</T>
    </C>
    <P>
        <T>Les poin&#x00e7;onneuses servent &#x00e0; trouer les cartes &#x00e0; perforer afin d&#x2019;y encoder des
            donn&#x00e9;es. Celle-ci est strictement m&#x00e9;canique&#x00a0;: son fonctionnement n&#x2019;exige aucune
            source d&#x2019;alimentation en courant &#x00e9;lectrique. Elle a &#x00e9;t&#x00e9; surtout utilis&#x00e9;e
            par les op&#x00e9;rateurs d&#x2019;ateliers de machines &#x00e0; cartes perfor&#x00e9;es pour la
            reproduction des cartes qui, par suite de fausses man&#x0153;uvres, ou de bourrages se trouvaient ab&#x00ee;m&#x00e9;es
            et pour les programmeurs afin de remplacer des instructions erron&#x00e9;es dans leurs programmes perfor&#x00e9;s
            sur cartes.
        </T>
    </P>
    <P>
        <T>La carte est plac&#x00e9;e sur la piste de perforation dans un chariot muni d&#x2019;une cr&#x00e9;maill&#x00e8;re
            dont les crans assurent la pr&#x00e9;sentation successive de chacune des 80 colonnes en regard du bloc de
            poin&#x00e7;onnage. Une aiguille indicatrice de position, qui se d&#x00e9;place devant la carte, guide l&#x2019;op&#x00e9;rateur
            afin de rep&#x00e9;rer la bonne colonne.
        </T>
    </P>
    <P>
        <T>Cette poin&#x00e7;onneuse a un clavier de 14 touches (plus 1 touche d&#x2019;&#x00e9;jection) commandant les
            d&#x00e9;placements de la carte et permet d&#x2019;agir sur les poin&#x00e7;ons de perforation. La poin&#x00e7;onneuse
        </T>
        <NXP>P80</NXP>
        <T>fut utilis&#x00e9;e jusqu&#x2019;&#x00e0; la fin des cartes perfor&#x00e9;es, c&#x2019;</T>
        <EXP>est-&#x00e0;-dire</EXP>
        <T>, jusqu&#x2019;au d&#x00e9;but des ann&#x00e9;es</T>
        <DT D="00001980">1980</DT>
        <T>.</T>
    </P>
    <P>
        <DP D="00112019">Date de publication: novembre 2019</DP>
    </P>
</top>
