<?xml version="1.0"?>
<?xml-stylesheet type="text/css" href="c:\inetpub\webpubdotnet\directio\web\css\bases\fipbinvkhs.css" ?>
<top>
<TIT6> <TIT> <T>L'ordinateur et les alphabets&#x2026;</T> </TIT> </TIT6> <INVID ID="FRB.P.INTER.1984.016.11">FRB.P.INTER.1984.016.11</INVID> <ISBD> <Z0> <TYPE/> <INV>2014</INV> <LIEU/> </Z0> </ISBD> <P> <T>De par ses origines </T> <EXP>anglo-saxonnes</EXP> <T>, l'informatique a utilis&#x00e9; pendant longtemps et presque exclusivement les majuscules de l'alphabet latin. Cependant de nouvelles applications, comme le traitement de textes, ont exig&#x00e9; l'emploi des minuscules ainsi que des signes diacritiques propres &#x00e0; certaines langues comme les accents fran&#x00e7;ais, l'umlaut allemand ou le tilde espagnol. Comment ce probl&#x00e8;me a-t-il &#x00e9;t&#x00e9; r&#x00e9;solu?</T> </P> <P> <T>Il faut savoir que deux codes existent pour repr&#x00e9;senter les caract&#x00e8;res:</T> </P> <P> <T/> <NXP>ASCII</NXP> <T>, pour tous les </T> <EXP>micro-ordinateurs</EXP> <T> et une partie des plus grosses machines, comprenant 128 positions dans la version standard.</T> </P> <P> <T/> <NXP>EBCDIC</NXP> <T>, propre &#x00e0; </T> <NXP>IBM</NXP> <T>, comprenant 256 positions mais avec de nombreux vides.</T> </P> <P> <T>La solution consistera donc &#x00e0; ajouter de nouvelles valeurs, &#x00e0; en ins&#x00e9;rer dans les vides ou bien &#x00e0; en supprimer certaines, inutiles, pour les remplacer par d'autres. Au niveau des imprimantes les constructeurs ont souvent pr&#x00e9;vu ces transformations gr&#x00e2;ce &#x00e0; diff&#x00e9;rents jeux de caract&#x00e8;res facilement accessibles par programme ou par un interrupteur. Mais au niveau de l'ordinateur lui-m&#x00ea;me, la valeur des nouveaux codes, l'emplacement sur le clavier des nouveaux caract&#x00e8;res, la fa&#x00e7;on de les utiliser, toutes ces modifications diff&#x00e8;rent d'une machine &#x00e0; l'autre &#x00e0; condition qu'elles existent car certains ordinateurs refusent obstin&#x00e9;ment de s'exprimer autrement qu'en caract&#x00e8;res &#x201c;anglais&#x201d;. Une troisi&#x00e8;me possibilit&#x00e9; peut se pr&#x00e9;senter, celle d'une transformation plus ou moins &#x201c;bricol&#x00e9;e&#x201d; qui ne fonctionne que dans certains cas ou n'est compatible qu'avec une partie du logiciel. Comme on le voit, de nombreuses surprises attendent un utilisateur non pr&#x00e9;venu!</T> </P> <P> <T>Et pour les autres alphabets?</T> </P> <P> <T>De rares machines poss&#x00e8;dent, d&#x00e8;s le d&#x00e9;part, un code </T> <NXP>ASCII</NXP> <T> &#x00e9;tendu comprenant les lettres grecques, majuscules et minuscules. Mais le probl&#x00e8;me se pose de nouveau pour les accents et les esprits en grec (une centaine de combinaisons) ainsi que pour la repr&#x00e9;sentation des caract&#x00e8;res h&#x00e9;breux ou arabes &#x00e0; diff&#x00e9;rents niveaux: consonnes seules, vocalisation, cantilation (quelques milliers de combinaisons). Une autre m&#x00e9;thode s'impose donc.</T> </P> <P> <T>Elle consiste &#x00e0; d&#x00e9;composer chaque caract&#x00e8;re en unit&#x00e9;s &#x00e9;l&#x00e9;mentaires, &#x00e0; introduire celles-ci dans une matrice pr&#x00e9;-&#x00e9;tablie et &#x00e0; la projeter sur le support, &#x00e9;cran ou papier. Cette technique permet de magnifiques repr&#x00e9;sentations, fid&#x00e8;les et esth&#x00e9;tiques, mais pr&#x00e9;sente le d&#x00e9;faut de n'&#x00ea;tre que graphique c'</T> <EXP>est-&#x00e0;-dire</EXP> <T> que l'ordinateur ne sait que dessiner ces nouveaux caract&#x00e8;res mais est incapable de les traiter. On ne peut tout avoir!!</T> </P> <P> <T>La repr&#x00e9;sentation des caract&#x00e8;res des langues bibliques a n&#x00e9;cessit&#x00e9; la mise au point par le </T> <NXP>Centre Informatique et Bible</NXP> <T> de diff&#x00e9;rentes proc&#x00e9;dures. La saisie des donn&#x00e9;es se fait au moyen d'un code de translitt&#x00e9;ration compos&#x00e9; des caract&#x00e8;res latins augment&#x00e9;s de signes sp&#x00e9;ciaux &#x00e0; valeur conventionnelle.</T> </P> <P> <T>&#x00c0; titre d'exemple:</T> <B/> <T>en fran&#x00e7;ais: 3</T> <NXP>AGIE</NXP> <T> : &#x00e2;g&#x00e9;; </T> <T> </T> <NXP>AIM2ERENT</NXP> <T>: aim&#x00e8;rent</T> <B/> <T>en grec: +</T> <NXP>EZEK1IAS</NXP> <T> : xxxxx; </T> <T> +<NB>2HN</NB> : xxxxx</T> <B/> <T>en h&#x00e9;breu: </T> <NXP>M,V*T</NXP> <T>: xxxxx; </T> <T> </T> <NXP>K*=T_,B</NXP> <T> </T> </P> <P> <T>Cette translitt&#x00e9;ration permet d'abord le traitement automatique par ordinateur et ensuite la v&#x00e9;rification et les modifications sur listing par les philologues. Ensuite vient l'&#x00e9;dition r&#x00e9;alis&#x00e9;e en caract&#x00e8;res originaux incluant toutes les caract&#x00e9;ristiques du grec, de l'h&#x00e9;breu, de l'arabe ou du syriaque, gr&#x00e2;ce &#x00e0; des programmes sp&#x00e9;cialis&#x00e9;s utilisant la m&#x00e9;thode des matrices d&#x00e9;crite </T> <EXP>ci-dessus</EXP> <T> et permettant l'&#x201c;Interface&#x201d; (!) vers une imprimante &#x00e0; laser ou vers une photocomposeuse.</T> </P> <P> <T>Ainsi est ma&#x00ee;tris&#x00e9; parfaitement un processus qui permet l'&#x00e9;tude et l'&#x00e9;dition de la </T> <NXP>Parole de Dieu</NXP> <T>.</T> </P> <P> <T>F. </T> <NXP>Lemoine</NXP> <T/> </P> <P><DP D="00112019">Date de publication: novembre 2019</DP><NXP>Collection I&#x0026;B</NXP></P>
</top>
