<?xml version="1.0"?>
<?xml-stylesheet type="text/css" href="c:\inetpub\webpubdotnet\directio\web\css\bases\fipbinvkhs.css" ?>
<top>
<TIT4><TIT> <T>Ressources &#x00e9;lectroniques de la </T> <NXP>Collection I&#x0026;B</NXP> </TIT></TIT4> <INVID ID="FRB.FNUMDIB">FRB.FNUMDIB</INVID> <P><T>Les ressources &#x00e9;lectroniques de la </T><NXP>Collection I&#x0026;B</NXP><T> rassemblent tous les fichiers et programmes cr&#x00e9;&#x00e9;s et produits durant plus de trente ans d'activit&#x00e9;s, soit &#x00b1; <NB>2.500.000</NB> et 180 Go de donn&#x00e9;es . Les ressources sont r&#x00e9;parties suivant les principaux chantiers ou r&#x00e9;alisations des travaux d'informatique appliqu&#x00e9;s au texte, les diff&#x00e9;rents dossiers sont class&#x00e9;s par ordre alphab&#x00e9;tique. Pour chaque dossier, et pour conserver le lien indispensable avec la documentation et les archives, les ressources sont conserv&#x00e9;es en unit&#x00e9;s correspondant, au d&#x00e9;part, &#x00e0; une bande magn&#x00e9;tique cr&#x00e9;&#x00e9;e soit &#x00e0; la </T><NXP>CGER</NXP><T>, soit sur l'</T><NXP>IBM Series/1</NXP><T> (nom avec suffixe </T><NXP>AS</NXP><T>), et ensuite aux diff&#x00e9;rents supports utilis&#x00e9;s: cassettes </T><NXP>IBM 3480</NXP><T> (cr&#x00e9;&#x00e9;s &#x00e0; la </T><NXP>CGER</NXP><T> ou sur le r&#x00e9;seau de </T><NXP>PC</NXP><T>), puis copie sur </T><NXP>CD-ROM</NXP><T> (nom commen&#x00e7;ant &#x00e0; 500000) ou sur disquettes et disques durs. Chaque unit&#x00e9; de support correspond &#x00e0; un &#x00e9;tat de sauvegarde &#x00e0; un moment donn&#x00e9;. Il est ainsi possible de suivre l'&#x00e9;volution d'un dossier dans ses diff&#x00e9;rentes versions ou &#x00e9;tapes depuis le d&#x00e9;but jusqu'au produit fini. En effet, la plupart de ces dossiers couraient sur plusieurs ann&#x00e9;es.</T></P> <P><T>Lors de la migration des cassettes </T><NXP>IBM 3480</NXP><T> sur </T><NXP>CD-ROM</NXP><T>,toujours avec le m&#x00ea;me principe de 1 pour 1, un fichier </T><EXP>info.txt</EXP><T> a &#x00e9;t&#x00e9; cr&#x00e9;&#x00e9; automatiquement pour chaque unit&#x00e9; de support, reprenant le nom, la date de cr&#x00e9;ation et la taille de chaque fichier. Les premiers fichiers &#x00e9;taient cod&#x00e9;s en </T><NXP>EBCDIC</NXP><T> et pas en </T><NXP>ASCII</NXP><T>, les fichiers en </T><NXP>EBCDIC</NXP><T> ont &#x00e9;t&#x00e9; convertis en </T><NXP>ASCII</NXP><T>, mais cette conversion peut apporter des probl&#x00e8;mes de codage. La structure des noms de fichiers a &#x00e9;t&#x00e9; conserv&#x00e9;e, ainsi par exemple, sur les bandes magn&#x00e9;tiques, le nom est compos&#x00e9; de segments et se termine par le num&#x00e9;ro de s&#x00e9;quence du fichier. Lors de la migration des fichiers sous </T><NXP>DOS</NXP><T>, le premier segment du nom de fichier n'a pu &#x00ea;tre conserv&#x00e9;. Sous </T><NXP>DOS</NXP><T> et au d&#x00e9;but de </T><NXP>Windows</NXP><T>, la structure de nom est de 8 caract&#x00e8;res maximum suivi d'une extension d&#x00e9;terminant le type de fichier.</T></P> <P><T>Ces ressources &#x00e9;lectroniques, fichiers de donn&#x00e9;es et programmes, ne sont exploitables et compr&#x00e9;hensibles, qu'en lien avec la documentation, les archives, les listings&#x2026; </T><T>Outre la documentation li&#x00e9;e &#x00e0; chaque chantier, 4 sources importantes permettent de retracer les fichiers:</T></P> <P><T><GR>1. Le fichier des fichiers</GR>: tri&#x00e9;s par ordre alphab&#x00e9;tique du nom, donne pour chaque fichier, son </T><NXP>DSN</NXP><T> complet, le </T><NXP>VOL-ID</NXP><T> et num&#x00e9;ro de s&#x00e9;quence, la taille des enregistrements, le nom du programme qui l'a cr&#x00e9;&#x00e9;. Renvoi &#x00e0; la G&#x00e9;n&#x00e9;alogie des fichiers. Concerne surtout les premiers traitements ex&#x00e9;cut&#x00e9;s sur les mainframes de la </T><NXP>CGER</NXP><T> jusqu'&#x00e0; la fin des ann&#x00e9;es 1970. 193 fiches num&#x00e9;ris&#x00e9;es, </T><T>voir </T> <VOIR ID="FRB.ARCH.IB.INF.BD-1341B1"> <IMG SRC="pics/goto1.gif"/> </VOIR> <REF>FRB.ARCH.IB.INF.BD-1341B1</REF></P> <P><T><GR>2. Le fichier des programmes</GR>: relev&#x00e9; de tous les programmes, tri&#x00e9;s par ordre alphab&#x00e9;tique du nom, donne pour chaque programme les noms des fichiers d'entr&#x00e9;e et de sortie et leur structure, et pour chaque ex&#x00e9;cution, la date et le temps d'ex&#x00e9;cution. Renvoi &#x00e0; la G&#x00e9;n&#x00e9;alogie des fichiers. </T><T>Concerne les ex&#x00e9;cutions sur les mainframes de la </T><NXP>CGER</NXP><T> jusqu'en fin des ann&#x00e9;es 1970: 378 fiches num&#x00e9;ris&#x00e9;es, </T><T>voir </T> <VOIR ID="FRB.ARCH.IB.INF.BD-1341B2"> <IMG SRC="pics/goto1.gif"/> </VOIR> <REF>FRB.ARCH.IB.INF.BD-1341B2</REF><B/></P> <P><T><GR>3. La g&#x00e9;n&#x00e9;alogie des fichiers</GR>: pour chaque chantier, un organigramme montre les diff&#x00e9;rents traitements, les fichiers d'entr&#x00e9;e et de sortie de chaque programme, le </T><NXP>DSN</NXP><T> complet de chaque fichier, la date de la derni&#x00e8;re ex&#x00e9;cution. Des renvois permettent de suivre la trace de chaque fichier. </T><T>Concerne les ex&#x00e9;cutions sur les mainframes de la </T><NXP>CGER</NXP><T> jusqu'en fin des ann&#x00e9;es 1970: 165 pages num&#x00e9;ris&#x00e9;es, </T><T>voir </T> <VOIR ID="FRB.ARCH.IB.INF.BD-1341B3"> <IMG SRC="pics/goto1.gif"/> </VOIR> <REF>FRB.ARCH.IB.INF.BD-1341B3</REF></P> <P><T><GR>4. La liste d&#x00e9;taill&#x00e9;e de tous les fichiers</GR>: une application de gestion des fichiers, appel&#x00e9;e </T><NXP>Gesfil</NXP><T> (encore ex&#x00e9;cutable dans une boite </T><NXP>DOS</NXP><T> 32 bits), a &#x00e9;t&#x00e9; r&#x00e9;alis&#x00e9;e, elle reprend tous les fichiers sur bandes magn&#x00e9;tiques et ensuite sur disquettes ou </T><NXP>CD-ROM</NXP><T>. Pour chaque fichier: le nom du suport (</T><NXP>VOL-ID</NXP><T>, le num&#x00e9;ro de s&#x00e9;quence, le nom du volume ou r&#x00e9;pertoire, le </T><NXP>DSN</NXP><T>, le nom du programme qui l'a produit, le type de fichier, la date de cr&#x00e9;ation, la taille des enregistrements et des blocs, le nombre d'enregistrements, le lieu de stockage, et un commentaire. Le programme peut trier les fichiers sur diff&#x00e9;rents crit&#x00e8;res et imprimer des listes. Une liste des fichiers sur Disque</T><T> et une des fichiers sur Bandes ont &#x00e9;t&#x00e9; cr&#x00e9;&#x00e9;es en 2004,</T><T>voir </T> <VOIR ID="FRB.ARCH.IB.INF.BD-87C"> <IMG SRC="pics/goto1.gif"/> </VOIR> <REF>FRB.ARCH.IB.INF.BD-87C</REF><T>.</T></P> <P><T>Le but de cet inventaire sommaire est donc de r&#x00e9;aliser les liens n&#x00e9;cessaires entre tous les &#x00e9;l&#x00e9;ments: &#x00e9;lectroniques et papier conserv&#x00e9;s et t&#x00e9;moins de l'&#x00e9;volution des traitements informatiques depuis les cartes perfor&#x00e9;es et l'</T><NXP>EBCDIC</NXP><T> jusqu'au </T><NXP>DOS</NXP><T>, </T><NXP>Windows</NXP><T> et les langages de programmation </T><NXP>COBOL</NXP><T>, </T><NXP>C++</NXP><T>, </T><NXP>Assembler</NXP><T>&#x2026;.Dans un second temps, il conviendrait que chaque fichier ou lot de fichiers puisse &#x00ea;tre d&#x00e9;crit en d&#x00e9;tail. </T></P> <P><T>Dans cette section particuli&#x00e8;re de la Base de Connaissances/Inventaire, la localisation des fichiers est donc exprim&#x00e9;e en &#x201c;nom complet du chemin de r&#x00e9;pertoires sur le disque dur de r&#x00e9;f&#x00e9;rence&#x201d; selon les r&#x00e8;gles utilis&#x00e9;es sous </T><NXP>Windows</NXP><T>. Le nom du dossier ou r&#x00e9;pertoire est aussi repris dans le num&#x00e9;ro d'inventaire. </T></P>
</top>
