<?xml version="1.0"?>
<?xml-stylesheet type="text/css" href="c:\inetpub\webpubdotnet\directio\web\css\bases\fipbinvkhs.css" ?>
<top>
<TIT6> <TIT> <T>En guise d'&#x00e9;ditorial</T> </TIT> </TIT6> <INVID ID="FRB.P.INTER.1982.007.01">FRB.P.INTER.1982.007.01</INVID> <ISBD> <Z0> <TYPE/> <INV>2014</INV> <LIEU/> </Z0> </ISBD> <P> <T>Nous devons &#x00e0; tous ceux qui nous aident, nous soutiennent et nous encouragent depuis deux ans par le biais de l'asbl </T> <NXP>Promotion Biblique et Informatique</NXP> <T> la franchise de l'information comme t&#x00e9;moignage de notre pr&#x00e9;sence au moment o&#x00f9; s'ach&#x00e8;ve 1982 et s'inaugure 1983.</T> </P> <P> <T>Comme nous l'avions laiss&#x00e9; entendre d&#x00e8;s le d&#x00e9;but de notre appel, l'</T> <NXP>Abbaye de Maredsous</NXP> <T> n'a plus les moyens humains et financiers pour soutenir l'&#x00e9;quipe de recherche biblique et informatique qu'elle a contribu&#x00e9; &#x00e0; cr&#x00e9;er.</T> </P> <P> <T>Gr&#x00e2;ce aux contacts nou&#x00e9;s avec de nombreux amis, nous cherchons, depuis un an, &#x00e0; sauver cette &#x00e9;quipe et tout l'immense travail r&#x00e9;alis&#x00e9; depuis dix ans.</T> </P> <P> <T>&#x00c0; cet effet nous avons cr&#x00e9;&#x00e9; une association internationale &#x201c;</T><NXP>Bible et Informatique</NXP><T>&#x201d; (voir informations plus loin) dont le si&#x00e8;ge social est &#x00e0; l'</T> <NXP>Abbaye de Maredsous</NXP> <T> et dont les objectifs visent &#x00e0; une recherche de fonds internationaux pour promouvoir le type d'&#x00e9;tudes et de publications que nous avons inaugur&#x00e9;es.</T> </P> <P> <T>Nous avions aussi pens&#x00e9; cr&#x00e9;er une soci&#x00e9;t&#x00e9; &#x00e0; caract&#x00e8;re plus commercial pour &#x00e9;quilibrer, au moyen de certaines applications plus industrielles de notre savoir-faire, l'&#x00e9;conomie d'une telle unit&#x00e9; de travail et en supporter les charges sociales et le d&#x00e9;veloppement (voir le sch&#x00e9;ma, page suivante). </T> </P> <P> <T>Ce second volet n'est pas encore au point, et la conjoncture de crise n'y aide pas. Apr&#x00e8;s une premi&#x00e8;re tentative infructueuse de montage en ce sens, il n'est pas impossible que nous soyons amen&#x00e9;s &#x00e0; conclure que notre &#x00e9;quipe doit rester avant tout un &#x201c;service d'&#x00e9;glise&#x201d; et, &#x00e0; ce titre, continuer de compter sur l'intelligence de chr&#x00e9;tiens qui voient l'avenir de la culture se forger dans des laboratoires comme le n&#x00f4;tre.</T> </P> <P> <T>Nous avons aussi pens&#x00e9; qu'un laboratoire de ce type aurait avantage &#x00e0; se rapprocher d'un centre universitaire. Dans la g&#x00e9;ographie de la </T> <NXP>Belgique</NXP> <T> francophone et en fonction des racines de l'&#x00e9;quipe, la ville de </T> <NXP>Namur</NXP> <T> et les </T> <NXP>Facult&#x00e9;s Universitaires Notre-Dame de la Paix</NXP> <T> nous semble l'environnement le mieux indiqu&#x00e9; actuellement. Nous esp&#x00e9;rons pouvoir poursuivre dans ce voisinage nos activit&#x00e9;s &#x00e0; partir de </T> <DT D="00001983">1983</DT> <T>, si &#x2026;</T> </P> <P> <T>Si&#x2026;</T> </P> <P> <T>&#x2026; l'asbl </T> <NXP LNP="ProBi">Promotion Biblique et Informatique</NXP> <T> peut trouver sous forme de pr&#x00ea;ts caritatifs ou de donations un capital suffisant pour assumer les charges sociales et les frais de fonctionnement de notre &#x00e9;quipe avant que ses membres ne se dispersent en qu&#x00ea;te d'une l&#x00e9;gitime subsistance et que ses ressources &#x00e9;lectroniques lui soient enlev&#x00e9;es.</T> </P> <P> <T>Il faudra quelque temps, en effet, pour que l'</T> <NXP LNP="AIBI">Association Internationale Bible et Informatique</NXP> <T> atteigne les r&#x00e9;sultats qu'on en esp&#x00e8;re.</T> </P> <P> <T>Mais les contrats de travail de la plupart d'entre nous expirent dans le premier semestre de 1983.</T> </P> <P> <T>Voici donc un d&#x00e9;but d'ann&#x00e9;e plein de questions. Vous nous aiderez &#x00e0; y r&#x00e9;pondre.</T> </P> <P> <T>Comment?</T> </P> <P> <T> En maintenant votre aide financi&#x00e8;re</T> </P> <P> <T> En nous signalant tout contact utile ou, mieux, en cr&#x00e9;ant vous-m&#x00ea;me ces contacts utiles.</T> </P> <P> <T> En nous proposant, si vous &#x00ea;tes en situation de le faire, certains travaux &#x00e0; fa&#x00e7;on dans le domaine de l'&#x00e9;dition &#x00e9;lectronique ou de l'informatique appliqu&#x00e9;e aux textes.</T> </P> <P> <T>En nous aidant, par la r&#x00e9;flexion et la pri&#x00e8;re, &#x00e0; trouver la place exacte de notre effort au service de la Parole de </T> <T/> <NXP>Dieu</NXP> </P> <P> <T>Au nom de tous les membres pass&#x00e9;s, actuels et &#x00e0; venir de notre &#x00e9;quipe, nous vous remercions pour ce que vous avez d&#x00e9;j&#x00e0; fait et pour ce que vous ferez encore et nous vous assurons de tous nos v&#x0153;ux pour 1983.</T> </P> <P> <T>Fr. </T> <NXP>R.-Ferdinand</NXP> <T> </T> <NXP>Poswick</NXP> <T>, </T> <T/> <EXP>o.s.b.</EXP> </P> <P><DP D="00112019">Date de publication: novembre 2019</DP><NXP>Collection I&#x0026;B</NXP></P>
</top>
